//
//  RelativeData_0.m
//  RelativeCalculator
//
//  Created by Zhanglx on 2021/7/22.
//

#import "RelativeData_0.h"

@implementation RelativeData_0

- (NSArray *)addRelativeData {
    
    return @[
    @[@"我", @"爸爸", @"妈妈", @"哥哥", @"弟弟", @"姐姐", @"妹妹", @"儿子", @"女儿", @"妻子", @"丈夫", @"未知亲戚"],
    @[@"爸爸", @"爷爷", @"奶奶", @"伯父", @"叔叔", @"姑妈", @"姑妈", @"我", @"妹妹", @"妈妈", @"不存在该种关系", @"未知亲戚"],
    @[@"妈妈", @"外公", @"外婆", @"大舅", @"小舅", @"大姨妈", @"小姨妈", @"我", @"妹妹", @"不存在该种关系", @"爸爸", @"未知亲戚"],
    @[@"哥哥", @"爸爸", @"妈妈", @"哥哥", @"我", @"姐姐", @"妹妹", @"侄儿", @"侄女", @"嫂子", @"不存在该种关系", @"未知亲戚"],
    @[@"弟弟", @"爸爸", @"妈妈", @"我", @"弟弟", @"姐姐", @"妹妹", @"侄儿", @"侄女", @"弟妹", @"不存在该种关系", @"未知亲戚"],
    @[@"姐姐", @"爸爸", @"妈妈", @"哥哥", @"我", @"姐姐", @"妹妹", @"外甥", @"外甥女", @"不存在该种关系", @"姐夫", @"未知亲戚"],
    @[@"妹妹", @"爸爸", @"妈妈", @"我", @"弟弟", @"姐姐", @"妹妹", @"外甥", @"外甥女", @"不存在该种关系", @"妹夫", @"未知亲戚"],
    @[@"儿子", @"我", @"妻子", @"哥哥", @"弟弟", @"姐姐", @"妹妹", @"孙子", @"孙女", @"儿媳", @"不存在该种关系", @"未知亲戚"],
    @[@"女儿", @"我", @"妻子", @"哥哥", @"弟弟", @"姐姐", @"妹妹", @"外孙", @"外孙女", @"不存在该种关系", @"女婿", @"未知亲戚"],
    @[@"妻子", @"岳父", @"岳母", @"大舅子", @"小舅子", @"大姨子", @"小姨子", @"儿子", @"女儿", @"不存在该种关系", @"我", @"未知亲戚"],
    @[@"丈夫", @"不存在该种关系", @"不存在该种关系", @"不存在该种关系", @"不存在该种关系", @"不存在该种关系", @"不存在该种关系", @"不存在该种关系", @"不存在该种关系",
            @"不存在该种关系", @"不存在该种关系", @"未知亲戚"],
    @[@"爷爷", @"曾祖父", @"曾祖母", @"伯祖父", @"伯祖父", @"姑奶奶", @"姑奶奶", @"爸爸", @"姑妈", @"奶奶", @"不存在该种关系", @"未知亲戚"],
    @[@"奶奶", @"曾外祖父", @"曾外祖母", @"舅公", @"舅公", @"姨奶奶", @"姨奶奶", @"爸爸", @"姑妈", @"不存在该种关系", @"爷爷", @"未知亲戚"]
    ];
}

@end
